spec/dummy/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "directions", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "blah"], ["directions", "cook in oven till black."], ["created_at", "2017-09-03 00:05:37.216811"], ["updated_at", "2017-09-03 00:05:37.216811"]]

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = ?, "directions" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "cookies"], ["directions", "cook in oven till black. Add butter"], ["updated_at", "2017-09-03 00:14:14.812535"], ["id", 1]]